spec/fixtures/cassettes/chargify_wrapper/subscription_reactivate/when_reactivation_fails_.yml

---
http_interactions:
- request:
    method: get
    uri: https://<CHARGIFY_SUBDOMAIN>.chargify.com/subscriptions/76900225.json
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Authorization:
      - "<CHARGIFY_API_KEY>"
      Accept:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private, no-store
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Fri, 19 Jul 2024 15:49:06 GMT
      Etag:
      - W/"177ca77bd2a0b5f3c1a77cd5a825b8ad"
      Referrer-Policy:
      - strict-origin-when-cross-origin
      Server:
      - nginx + Phusion Passenger(R)
      Status:
      - 200 OK
      Strict-Transport-Security:
      - max-age=31536000
      X-Content-Type-Options:
      - nosniff
      X-Download-Options:
      - noopen
      X-Frame-Options:
      - SAMEORIGIN
      X-Permitted-Cross-Domain-Policies:
      - none
      X-Powered-By:
      - Phusion Passenger(R) Enterprise
      X-Request-Id:
      - 822be3a1-521c-4d44-a0d2-375260c15e44
      X-Runtime:
      - '0.140960'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"subscription":{"id":76900225,"state":"active","trial_started_at":"2024-06-28T07:23:22-07:00","trial_ended_at":"2024-06-28T07:41:00-07:00","activated_at":"2024-07-10T10:40:26-07:00","created_at":"2024-06-28T07:23:22-07:00","updated_at":"2024-07-10T10:40:26-07:00","expires_at":null,"balance_in_cents":0,"current_period_ends_at":"2024-08-10T10:40:26-07:00","next_assessment_at":"2024-08-10T10:40:26-07:00","canceled_at":null,"cancellation_message":null,"next_product_id":null,"next_product_handle":null,"cancel_at_end_of_period":false,"payment_collection_method":"automatic","snap_day":null,"cancellation_method":null,"current_period_started_at":"2024-07-10T10:40:26-07:00","previous_state":"trial_ended","signup_payment_id":1100331778,"signup_revenue":"0.00","delayed_cancel_at":null,"coupon_code":null,"total_revenue_in_cents":2800,"product_price_in_cents":2800,"product_version_number":1,"payment_type":"credit_card","referral_code":null,"coupon_use_count":null,"coupon_uses_allowed":null,"reason_code":null,"automatically_resume_at":null,"coupon_codes":[],"offer_id":null,"payer_id":null,"receives_invoice_emails":null,"product_price_point_id":2245037,"next_product_price_point_id":null,"net_terms":null,"stored_credential_transaction_id":null,"reference":null,"currency":"USD","on_hold_at":null,"scheduled_cancellation_at":null,"product_price_point_type":"default","dunning_communication_delay_enabled":false,"dunning_communication_delay_time_zone":null,"current_billing_amount_in_cents":2800,"customer":{"id":80814832,"first_name":"Luana","last_name":"1","organization":null,"email":"ls1@gmail.com","created_at":"2024-06-28T07:23:22-07:00","updated_at":"2024-06-28T07:23:22-07:00","reference":null,"address":null,"address_2":null,"city":null,"state":null,"state_name":null,"zip":null,"country":null,"country_name":null,"phone":null,"portal_invite_last_sent_at":null,"portal_invite_last_accepted_at":null,"verified":false,"portal_customer_created_at":null,"vat_number":null,"cc_emails":null,"tax_exempt":false,"parent_id":null},"product":{"id":6388924,"name":"Solo","handle":"solo-monthly-trial","description":"Users:
        1\r\nPersonalities: 10","accounting_code":"13","request_credit_card":true,"expiration_interval":null,"expiration_interval_unit":"never","created_at":"2022-12-15T06:06:29-08:00","updated_at":"2024-07-01T10:15:20-07:00","price_in_cents":2800,"interval":1,"interval_unit":"month","initial_charge_in_cents":null,"trial_price_in_cents":0,"trial_interval":14,"trial_interval_unit":"day","archived_at":null,"require_credit_card":false,"return_params":"","taxable":false,"update_return_url":"","tax_code":"","initial_charge_after_trial":false,"version_number":1,"update_return_params":"","default_product_price_point_id":2245037,"request_billing_address":false,"require_billing_address":false,"require_shipping_address":false,"use_site_exchange_rate":true,"item_category":null,"product_price_point_id":2245037,"product_price_point_name":"New
        Price May 2021","product_price_point_handle":"uuid:2feeb150-8c25-0139-e08c-06de0fa030d9","product_family":{"id":2473952,"name":"Blinkbid
        - USA","description":"Blinkbid software sold in the United States, in USD
        currency.","handle":"blinkbid-usa","accounting_code":null,"created_at":"2022-12-15T06:06:29-08:00","updated_at":"2022-12-15T06:06:29-08:00"},"public_signup_pages":[]},"credit_card":{"id":59954200,"first_name":"Johnn","last_name":"Doeeewewe","masked_card_number":"XXXX-XXXX-XXXX-1","card_type":"bogus","expiration_month":12,"expiration_year":2032,"customer_id":80814832,"current_vault":"bogus","vault_token":"1","billing_address":null,"billing_city":null,"billing_state":null,"billing_zip":null,"billing_country":null,"customer_vault_token":null,"billing_address_2":null,"payment_type":"credit_card","disabled":false,"site_gateway_setting_id":26995,"gateway_handle":null}}}'
  recorded_at: Fri, 19 Jul 2024 15:49:12 GMT
- request:
    method: put
    uri: https://<CHARGIFY_SUBDOMAIN>.chargify.com/subscriptions/76900225/reactivate.json
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      Authorization:
      - "<CHARGIFY_API_KEY>"
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 422
      message: Unprocessable Entity
    headers:
      Cache-Control:
      - private, no-store
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Fri, 19 Jul 2024 15:49:07 GMT
      Referrer-Policy:
      - strict-origin-when-cross-origin
      Server:
      - nginx + Phusion Passenger(R)
      Status:
      - 422 Unprocessable Entity
      X-Content-Type-Options:
      - nosniff
      X-Download-Options:
      - noopen
      X-Frame-Options:
      - SAMEORIGIN
      X-Permitted-Cross-Domain-Policies:
      - none
      X-Powered-By:
      - Phusion Passenger(R) Enterprise
      X-Request-Id:
      - 0d901884-95d2-4467-83f1-55e68a119797
      X-Runtime:
      - '0.110873'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"errors":["Cannot reactivate a subscription that is not marked \"Canceled\"
        or \"Trial Ended\"."]}'
  recorded_at: Fri, 19 Jul 2024 15:49:13 GMT
recorded_with: VCR 6.2.0
