spec/fixtures/cassettes/chargify_wrapper/subscription_reactivate_subscription/when_resume_is_set_to_true_.yml

---
http_interactions:
- request:
    method: get
    uri: https://<CHARGIFY_SUBDOMAIN>.chargify.com/subscriptions/77203965.json
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Authorization:
      - "<CHARGIFY_API_KEY>"
      Accept:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private, no-store
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Thu, 11 Jul 2024 19:07:32 GMT
      Etag:
      - W/"b11eff655aa6d7e7cf3b94c103a31844"
      Referrer-Policy:
      - strict-origin-when-cross-origin
      Server:
      - nginx + Phusion Passenger(R)
      Status:
      - 200 OK
      Strict-Transport-Security:
      - max-age=31536000
      X-Content-Type-Options:
      - nosniff
      X-Download-Options:
      - noopen
      X-Frame-Options:
      - SAMEORIGIN
      X-Permitted-Cross-Domain-Policies:
      - none
      X-Powered-By:
      - Phusion Passenger(R) Enterprise
      X-Request-Id:
      - 1eefa040-ce78-4dac-8ae3-4a75ae634282
      X-Runtime:
      - '0.092157'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"subscription":{"id":77203965,"state":"active","trial_started_at":"2024-07-11T11:42:57-07:00","trial_ended_at":"2024-07-11T11:51:00-07:00","activated_at":"2024-07-11T12:07:26-07:00","created_at":"2024-07-11T11:42:57-07:00","updated_at":"2024-07-11T12:07:26-07:00","expires_at":null,"balance_in_cents":0,"current_period_ends_at":"2025-07-11T12:07:26-07:00","next_assessment_at":"2025-07-11T12:07:26-07:00","canceled_at":null,"cancellation_message":null,"next_product_id":null,"next_product_handle":null,"cancel_at_end_of_period":false,"payment_collection_method":"automatic","snap_day":null,"cancellation_method":null,"current_period_started_at":"2024-07-11T12:07:26-07:00","previous_state":"trial_ended","signup_payment_id":1110505679,"signup_revenue":"0.00","delayed_cancel_at":null,"coupon_code":null,"total_revenue_in_cents":28800,"product_price_in_cents":28800,"product_version_number":1,"payment_type":"credit_card","referral_code":null,"coupon_use_count":null,"coupon_uses_allowed":null,"reason_code":null,"automatically_resume_at":null,"coupon_codes":[],"offer_id":null,"payer_id":null,"receives_invoice_emails":null,"product_price_point_id":2245073,"next_product_price_point_id":null,"net_terms":null,"stored_credential_transaction_id":null,"reference":null,"currency":"USD","on_hold_at":null,"scheduled_cancellation_at":null,"product_price_point_type":"default","dunning_communication_delay_enabled":false,"dunning_communication_delay_time_zone":null,"current_billing_amount_in_cents":28800,"customer":{"id":81101543,"first_name":"Luana","last_name":"Saraiva
        8","organization":null,"email":"ls8@gmail.com","created_at":"2024-07-11T11:42:57-07:00","updated_at":"2024-07-11T11:42:57-07:00","reference":null,"address":null,"address_2":null,"city":null,"state":null,"state_name":null,"zip":null,"country":null,"country_name":null,"phone":null,"portal_invite_last_sent_at":null,"portal_invite_last_accepted_at":null,"verified":false,"portal_customer_created_at":null,"vat_number":null,"cc_emails":null,"tax_exempt":false,"parent_id":null},"product":{"id":6388932,"name":"Solo","handle":"solo-annual-trial","description":"Users:
        1\r\nPersonalities: 10","accounting_code":"11","request_credit_card":true,"expiration_interval":null,"expiration_interval_unit":"never","created_at":"2022-12-15T06:06:31-08:00","updated_at":"2024-07-01T10:16:15-07:00","price_in_cents":28800,"interval":12,"interval_unit":"month","initial_charge_in_cents":null,"trial_price_in_cents":0,"trial_interval":14,"trial_interval_unit":"day","archived_at":null,"require_credit_card":false,"return_params":"","taxable":false,"update_return_url":"","tax_code":"","initial_charge_after_trial":false,"version_number":1,"update_return_params":"","default_product_price_point_id":2245073,"request_billing_address":false,"require_billing_address":false,"require_shipping_address":false,"use_site_exchange_rate":true,"item_category":null,"product_price_point_id":2245073,"product_price_point_name":"New
        Price May 2021","product_price_point_handle":"uuid:71f899e0-8c25-0139-8dc8-0a575a757c23","product_family":{"id":2473952,"name":"Blinkbid
        - USA","description":"Blinkbid software sold in the United States, in USD
        currency.","handle":"blinkbid-usa","accounting_code":null,"created_at":"2022-12-15T06:06:29-08:00","updated_at":"2022-12-15T06:06:29-08:00"},"public_signup_pages":[]},"credit_card":{"id":60047114,"first_name":"Johnn","last_name":"Doeee","masked_card_number":"XXXX-XXXX-XXXX-1111","card_type":"visa","expiration_month":5,"expiration_year":2031,"customer_id":81101543,"current_vault":"bogus","vault_token":"1","billing_address":"Los
        Angeles","billing_city":"LA","billing_state":"AL","billing_zip":"1212121212","billing_country":"US","customer_vault_token":null,"billing_address_2":null,"payment_type":"credit_card","disabled":false,"site_gateway_setting_id":null,"gateway_handle":null}}}'
  recorded_at: Thu, 11 Jul 2024 19:07:38 GMT
recorded_with: VCR 6.2.0
